perf-tests/results_20260402_201751/spring/k6_ramp_customer_summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /Users/naghayev/Desktop/investigate_bff/perf-tests/tests/../k6_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m10s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 05/50 VUs, 25 complete and 0 interrupted iterations
default   [   2% ] 05/50 VUs  01.0s/40.0s

running (0m02.0s), 10/50 VUs, 100 complete and 0 interrupted iterations
default   [   5% ] 10/50 VUs  02.0s/40.0s

running (0m03.0s), 15/50 VUs, 220 complete and 0 interrupted iterations
default   [   7% ] 15/50 VUs  03.0s/40.0s

running (0m04.0s), 20/50 VUs, 342 complete and 0 interrupted iterations
default   [  10% ] 20/50 VUs  04.0s/40.0s

running (0m05.0s), 25/50 VUs, 430 complete and 0 interrupted iterations
default   [  12% ] 25/50 VUs  05.0s/40.0s

running (0m06.0s), 30/50 VUs, 683 complete and 0 interrupted iterations
default   [  15% ] 30/50 VUs  06.0s/40.0s

running (0m07.0s), 35/50 VUs, 1003 complete and 0 interrupted iterations
default   [  17% ] 35/50 VUs  07.0s/40.0s

running (0m08.0s), 40/50 VUs, 1373 complete and 0 interrupted iterations
default   [  20% ] 40/50 VUs  08.0s/40.0s

running (0m09.0s), 45/50 VUs, 1793 complete and 0 interrupted iterations
default   [  22% ] 45/50 VUs  09.0s/40.0s

running (0m10.0s), 49/50 VUs, 2214 complete and 0 interrupted iterations
default   [  25% ] 49/50 VUs  10.0s/40.0s

running (0m11.0s), 50/50 VUs, 2363 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  11.0s/40.0s

running (0m12.0s), 50/50 VUs, 2813 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  12.0s/40.0s

running (0m13.0s), 50/50 VUs, 3263 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  13.0s/40.0s

running (0m14.0s), 50/50 VUs, 3763 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  14.0s/40.0s

running (0m15.0s), 50/50 VUs, 4263 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  15.0s/40.0s

running (0m16.0s), 50/50 VUs, 4763 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  16.0s/40.0s

running (0m17.0s), 50/50 VUs, 5113 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  17.0s/40.0s

running (0m18.0s), 50/50 VUs, 5313 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  18.0s/40.0s

running (0m19.0s), 50/50 VUs, 5813 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  19.0s/40.0s

running (0m20.0s), 50/50 VUs, 6263 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  20.0s/40.0s

running (0m21.0s), 50/50 VUs, 6763 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  21.0s/40.0s

running (0m22.0s), 50/50 VUs, 7263 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  22.0s/40.0s

running (0m23.0s), 50/50 VUs, 7732 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  23.0s/40.0s

running (0m24.0s), 50/50 VUs, 7913 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  24.0s/40.0s

running (0m25.0s), 50/50 VUs, 8263 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  25.0s/40.0s

running (0m26.0s), 50/50 VUs, 8763 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  26.0s/40.0s

running (0m27.0s), 50/50 VUs, 9263 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  27.0s/40.0s

running (0m28.0s), 50/50 VUs, 9750 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  28.0s/40.0s

running (0m29.0s), 50/50 VUs, 10213 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  29.0s/40.0s

running (0m30.0s), 50/50 VUs, 10663 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  30.0s/40.0s

running (0m31.0s), 46/50 VUs, 10806 complete and 0 interrupted iterations
default   [  77% ] 46/50 VUs  31.0s/40.0s

running (0m32.0s), 41/50 VUs, 11200 complete and 0 interrupted iterations
default   [  80% ] 41/50 VUs  32.0s/40.0s

running (0m33.0s), 36/50 VUs, 11585 complete and 0 interrupted iterations
default   [  82% ] 36/50 VUs  33.0s/40.0s

running (0m34.0s), 31/50 VUs, 11920 complete and 0 interrupted iterations
default   [  85% ] 31/50 VUs  34.0s/40.0s

running (0m35.0s), 26/50 VUs, 12183 complete and 0 interrupted iterations
default   [  87% ] 26/50 VUs  35.0s/40.0s

running (0m36.0s), 21/50 VUs, 12415 complete and 0 interrupted iterations
default   [  90% ] 21/50 VUs  36.0s/40.0s

running (0m37.0s), 19/50 VUs, 12476 complete and 0 interrupted iterations
default   [  92% ] 19/50 VUs  37.0s/40.0s

running (0m38.0s), 11/50 VUs, 12584 complete and 0 interrupted iterations
default   [  95% ] 11/50 VUs  38.0s/40.0s

running (0m39.0s), 06/50 VUs, 12669 complete and 0 interrupted iterations
default   [  97% ] 06/50 VUs  39.0s/40.0s

running (0m40.0s), 01/50 VUs, 12700 complete and 0 interrupted iterations
default   [ 100% ] 01/50 VUs  40.0s/40.0s

     ✓ status 200

     checks.........................: 100.00% 12701 out of 12701
     data_received..................: 7.6 MB  191 kB/s
     data_sent......................: 1.3 MB  32 kB/s
     http_req_blocked...............: avg=9.48µs   min=0s       med=3µs      max=1.42ms   p(90)=7µs      p(95)=10µs    
     http_req_connecting............: avg=4.32µs   min=0s       med=0s       max=1.22ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=18.46ms  min=227µs    med=1.99ms   max=914.36ms p(90)=5.13ms   p(95)=6.95ms  
       { expected_response:true }...: avg=18.46ms  min=227µs    med=1.99ms   max=914.36ms p(90)=5.13ms   p(95)=6.95ms  
     http_req_failed................: 0.00%   0 out of 12701
     http_req_receiving.............: avg=46.82µs  min=4µs      med=28µs     max=4.64ms   p(90)=87µs     p(95)=122µs   
     http_req_sending...............: avg=17.13µs  min=1µs      med=7µs      max=3.6ms    p(90)=27µs     p(95)=55µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=18.4ms   min=214µs    med=1.92ms   max=914.34ms p(90)=5.04ms   p(95)=6.85ms  
     http_reqs......................: 12701   317.332617/s
     iteration_duration.............: avg=118.89ms min=100.28ms med=102.47ms max=1.01s    p(90)=105.62ms p(95)=107.42ms
     iterations.....................: 12701   317.332617/s
     vus............................: 1       min=1              max=50
     vus_max........................: 50      min=50             max=50


running (0m40.0s), 00/50 VUs, 12701 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  40s