perf-tests/results_20260402_201751/spring/k6_ramp_customers.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /Users/naghayev/Desktop/investigate_bff/perf-tests/tests/../k6_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m10s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 05/50 VUs, 25 complete and 0 interrupted iterations
default   [   2% ] 05/50 VUs  01.0s/40.0s

running (0m02.0s), 10/50 VUs, 100 complete and 0 interrupted iterations
default   [   5% ] 10/50 VUs  02.0s/40.0s

running (0m03.0s), 15/50 VUs, 225 complete and 0 interrupted iterations
default   [   7% ] 15/50 VUs  03.0s/40.0s

running (0m04.0s), 20/50 VUs, 264 complete and 0 interrupted iterations
default   [  10% ] 20/50 VUs  04.0s/40.0s

running (0m05.0s), 25/50 VUs, 464 complete and 0 interrupted iterations
default   [  12% ] 25/50 VUs  05.0s/40.0s

running (0m06.0s), 30/50 VUs, 734 complete and 0 interrupted iterations
default   [  15% ] 30/50 VUs  06.0s/40.0s

running (0m07.0s), 35/50 VUs, 1046 complete and 0 interrupted iterations
default   [  17% ] 35/50 VUs  07.0s/40.0s

running (0m08.0s), 40/50 VUs, 1397 complete and 0 interrupted iterations
default   [  20% ] 40/50 VUs  08.0s/40.0s

running (0m09.0s), 45/50 VUs, 1817 complete and 0 interrupted iterations
default   [  22% ] 45/50 VUs  09.0s/40.0s

running (0m10.0s), 49/50 VUs, 2027 complete and 0 interrupted iterations
default   [  25% ] 49/50 VUs  10.0s/40.0s

running (0m11.0s), 50/50 VUs, 2327 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  11.0s/40.0s

running (0m12.0s), 50/50 VUs, 2827 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  12.0s/40.0s

running (0m13.0s), 50/50 VUs, 3327 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  13.0s/40.0s

running (0m14.0s), 50/50 VUs, 3777 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  14.0s/40.0s

running (0m15.0s), 50/50 VUs, 4277 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  15.0s/40.0s

running (0m16.0s), 50/50 VUs, 4777 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  16.0s/40.0s

running (0m17.0s), 50/50 VUs, 4827 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  17.0s/40.0s

running (0m18.0s), 50/50 VUs, 5327 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  18.0s/40.0s

running (0m19.0s), 50/50 VUs, 5777 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  19.0s/40.0s

running (0m20.0s), 50/50 VUs, 6277 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  20.0s/40.0s

running (0m21.0s), 50/50 VUs, 6777 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  21.0s/40.0s

running (0m22.0s), 50/50 VUs, 7277 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  22.0s/40.0s

running (0m23.0s), 50/50 VUs, 7527 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  23.0s/40.0s

running (0m24.0s), 50/50 VUs, 7777 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  24.0s/40.0s

running (0m25.0s), 50/50 VUs, 8277 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  25.0s/40.0s

running (0m26.0s), 50/50 VUs, 8777 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  26.0s/40.0s

running (0m27.0s), 50/50 VUs, 9277 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  27.0s/40.0s

running (0m28.0s), 50/50 VUs, 9727 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  28.0s/40.0s

running (0m29.0s), 50/50 VUs, 10227 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  29.0s/40.0s

running (0m30.0s), 50/50 VUs, 10303 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  30.0s/40.0s

running (0m31.0s), 46/50 VUs, 10762 complete and 0 interrupted iterations
default   [  77% ] 46/50 VUs  31.0s/40.0s

running (0m32.0s), 41/50 VUs, 11197 complete and 0 interrupted iterations
default   [  80% ] 41/50 VUs  32.0s/40.0s

running (0m33.0s), 36/50 VUs, 11582 complete and 0 interrupted iterations
default   [  82% ] 36/50 VUs  33.0s/40.0s

running (0m34.0s), 31/50 VUs, 11886 complete and 0 interrupted iterations
default   [  85% ] 31/50 VUs  34.0s/40.0s

running (0m35.0s), 26/50 VUs, 12171 complete and 0 interrupted iterations
default   [  87% ] 26/50 VUs  35.0s/40.0s

running (0m36.0s), 23/50 VUs, 12318 complete and 0 interrupted iterations
default   [  90% ] 23/50 VUs  36.0s/40.0s

running (0m37.0s), 16/50 VUs, 12409 complete and 0 interrupted iterations
default   [  92% ] 16/50 VUs  37.0s/40.0s

running (0m38.0s), 11/50 VUs, 12544 complete and 0 interrupted iterations
default   [  95% ] 11/50 VUs  38.0s/40.0s

running (0m39.0s), 06/50 VUs, 12629 complete and 0 interrupted iterations
default   [  97% ] 06/50 VUs  39.0s/40.0s

running (0m40.0s), 01/50 VUs, 12661 complete and 0 interrupted iterations
default   [ 100% ] 01/50 VUs  40.0s/40.0s

     ✓ status 200

     checks.........................: 100.00% 12662 out of 12662
     data_received..................: 3.4 MB  85 kB/s
     data_sent......................: 1.1 MB  28 kB/s
     http_req_blocked...............: avg=11.02µs  min=0s       med=3µs      max=4.21ms   p(90)=7µs      p(95)=11µs    
     http_req_connecting............: avg=5.03µs   min=0s       med=0s       max=2.33ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=18.49ms  min=219µs    med=1.8ms    max=899.5ms  p(90)=4.75ms   p(95)=6.64ms  
       { expected_response:true }...: avg=18.49ms  min=219µs    med=1.8ms    max=899.5ms  p(90)=4.75ms   p(95)=6.64ms  
     http_req_failed................: 0.00%   0 out of 12662
     http_req_receiving.............: avg=54.14µs  min=4µs      med=26µs     max=10.65ms  p(90)=90µs     p(95)=146µs   
     http_req_sending...............: avg=19.42µs  min=1µs      med=7µs      max=4.17ms   p(90)=30µs     p(95)=65µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=18.42ms  min=198µs    med=1.73ms   max=899.46ms p(90)=4.67ms   p(95)=6.51ms  
     http_reqs......................: 12662   316.373282/s
     iteration_duration.............: avg=119.21ms min=100.25ms med=102.59ms max=999.82ms p(90)=105.71ms p(95)=107.82ms
     iterations.....................: 12662   316.373282/s
     vus............................: 1       min=1              max=50
     vus_max........................: 50      min=50             max=50


running (0m40.0s), 00/50 VUs, 12662 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  40s